Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: Examples of equipment which may be needed in connection with first aid include bandaging materials, blankets, fire-fighting equipment, stretchers, protective gloves against contaminated blood, etc. Emergency showers and devices for eye flushing are also in this category.
sv: Exempel på utrustning som kan behövas i samband med första hjälpen är förbandsmaterial, filt ar, brandredskap, bårar, skyddshandskar mot blod- smitta etc.

source: A large variety of equipment is available.
sv: Det finns ett omfattande utbud av utrustning .

source: However, equipment needs for first aid are usually relatively limited, and can be adapted to local risks and to the availability of prompt and adequate medical assistance.
sv: Behovet av utrustning för första hjälpen är dock i de flesta fall relativt begränsat och kan anpassas till de lokala riskerna samt till förut sättning arna för att få en adekvat medicinsk hjälp.

source: For mobile work, equipment can be stored in the vehicle used or in a special belt bag, for example.
sv: Vid ambulerande arbete kan utrustning t.ex. förvaras i bilen eller i speciell midjeväska.

source: Accident preparedness in extremes of climate (e.g. outdoors in the winter) should take the climate into account in the selection of equipment.
sv: Om olycka kan befaras ske vid extremt klimat (t.ex. uto mhus vintertid) bör även detta beaktas vid val av utrustning .

source: It is important that equipment is stored accessibly but securely.
sv: Det är viktigt att utrustning en förvaras lättillg ängligt men säkert.

source: Section 8, Chapter 2 of the Work Environment Act lays down the requirements for first aid in the event of an accident or illness, to the extent warranted by the nature of the work and the needs of the employee.
sv: I 2 kap 8 § arbetsmiljöl agen ställs krav på utry mmen och anordning ar för första hjälpen vid olycksfall eller sjukdom i den utsträckning som föranleds av arbetets art och arbetstagarnas behov.

source: It is important to consider the need to be able to get and in and out of the work location with a stretcher, that there is a telephone or other means of communication, and that the need for first aid equipment is met in the work location in question.
sv: Det är viktigt att beakta behovet av att kunna komma in och ut med bår, att telefon eller annan signalanordning finns samt att behovet av utrustning för första hjälpen till - godoses i detta utry mm e.

source: The Work Environment Authority’s provisions on staff facilities contain rules about rest facilities and staff cubicles.
sv: I Arbetarskyddsstyrelsens föreskrifter om per- sonalutry mmen finns regler om vilutry mmen och personalbodar.

source: If such spaces are intended to be used for first aid tasks, it is important that the needs mentioned above are met.
sv: Om sådant utry mme avses komma ifråga för första hjälpen-uppgift er är det viktigt att ovan nämnda behov tillgodo ses.

source: Regulations regarding the design of signs can be found in the Work Environment Authority’s provisions on warning signs and notices in the workplace.
sv: Bestämmelser om utfor mning av skyltar finns i Arbetarskyddsstyrelsens föreskrifter om varselmärkning och varselsignalering på arbetsplatser.

source: Guidance on Section 9 Eye flushing
sv: Till 9 § Ögonspolning

source: Substances and products that can cause eye injury
sv: Äm nen och produ kt er som kan ge ögonskada

source: Chemical products introduced in the market must have a health and safety classification in accordance with criteria specified in the Swedish Chemicals Agency’s regulations on the classification and labeling of chemical products.
sv: Kemiska produ kter skall vid introdu ktion på marknaden vara klassificerade med avseende på sin hälsofarligh et enligt kriterierna i Kemikaliein- spektion ens föreskrift er om klassificering och märkning.

source: The risk phrases must be clear from the labeling and from the product information leaflet.
sv: Riskfraserna skall framgå av märkning och varuinfor mationsblad.

source: All corrosive substances can cause serious eye injury if they splash in the eyes.
sv: Alla frätande ämnen kan vid stänk i ögat ge upphov till allvarliga ögonskador.

source: If there is any uncertainty about whether a substance or product can cause eye injury, the advice of a suitable expert should be sought for the risk assessment.
sv: Om osäkerhet råder om ett ämne eller produ kt kan ge ögonskada bör lämplig expertis rådfrågas vid riskbedömningen.

source: Appendix 3 lists examples of substances that can cause eye injury.
sv: I bilaga 3 ges exempel på ämnen som kan ge ögonskada.

source: Measures in the event of an accident
sv: Åt gärder vid inträff at olyc ksfall

source: In order for eye flushing to have a maximum effect, three conditions apply in particular:
sv: För att ögonspolning skall få maximal effekt gäller framför allt tre förut - sättning ar, nämligen:

source: Flushing must begin immediately.
sv: Att spolning inleds omedelbart.

source: It is the only way to prevent or limit serious injury, and it may be a matter of seconds.
sv: Det är det enda sättet att förebygga eller begränsa allvarliga skador, och det kan gälla sekunder.

source: Flushing must continue for a long time.
sv: Att man spolar länge.

source: The eyelids must be kept wide open during flushing.
sv: Att ögonlo cken hålls brett isär under spolning en.

source: If a corrosive substance splashes in the eyes
sv: Efter stänk med frätande ämne i ögat

source: Flush immediately with a soft jet of water or eye flushing fluid for at least 15 minutes.
sv: Spola omedelbart med mjuk vattenstråle eller ögonspolvätska minst 15 minuter.

source: Keep the eyelids wide open during flushing so that nothing gets stuck underneath them.
sv: Håll ögonlo cken brett isär under spolning en så att inget fastnar under dem.

source: After the initial flushing, the casualty should be transported to a hospital or a doctor.
sv: Efter den initi ala spolning en bör den skadade transporteras till sjukhus eller läkare.

source: For alkaline splashes the eye flushing should continue during transportation.
sv: Vid alkalistänk bör ögonspolning en fortsätta även under transporten.

source: This is particularly important if the nearest hospital is located far away.
sv: Detta är extra viktigt om det är långt till närmaste sjukhus.

source: If that is the case, make sure there are enough bottles of eye flushing fluid to last all the way to the hospital.
sv: Man bör då ha så många ögonspolning sflaskor att de räcker fram till sjukhuset.

source: However, the fact of continuing flushing is far more important than the quantity of liquid used in prolonged flushing.
sv: Att sköljning sker betyder dock vida mer än kvantiteten spol- vätska vid denna förlängda sköljning .

source: If an irritant substance splashes in the eyes
sv: Efter stänk av irriterande ämne i ögat

source: Flush immediately with a soft yet of water or eye flushing fluid for at least 5 minutes.
sv: Spola omedelbart med mjuk vattenstråle eller ögonspolvätska minst 5 minuter.

source: If complaints (intense smarting, pain, sensitivity to light, vision disturbances) persist, continue flushing and contact or visit a hospital or doctor.
sv: Vid kvarstående besvär (intensiv sveda, smärta, ljuskänslighet, synpåverkan) fortsätt att spola och kontakta/uppsök sjukhus eller läkare.

source: If a foreign particle gets stuck in the eye
sv: Efter att ha fått främmande partikel i ögat

source: Flush the eye with a soft jet of water from a flushing device, a clean drinking glass, or something similar, until the particle is gone.
sv: Spola ögat, med mjuk vattenstråle från spolanordning , rent dricksglas eller dylikt, till s partikeln är bort a.

source: If the foreign particle cannot be flushed out, a doctor should examine the eye.
sv: Om det inte går att spola bort den främmande partikeln bör läkare undersöka ögat.

source: Eye flushing device
sv: Anordning för ögonspolning

source: Location
sv: Placering

source: It is of the utmost importance that the eye flushing device is kept in the immediate vicinity of the workstation.
sv: Det är ytterst viktigt att anordning en för ögonspolning finns i omedelbar närhet av arbetsplatsen.

source: Ideally it should be possible to get to the device and begin flushing within a few seconds.
sv: Man bör helst ha nått och utlöst spolning en ino m några sekunder.

source: It is therefore important that the route to the flushing device is not blocked.
sv: Därför är det viktigt att vägen till spolanordning en inte blockeras.

source: The device should be so placed that the casualty, without looking and without help, can make their own way to it quickly.
sv: Anordning en bör vara placerad så att den skadade, utan att kunna se och utan hjälp, själv snabbt kan hitta fram till den.

source: In workstations where it is difficult to have a device which allows for sufficient flushing time placed in the immediate vicinity, bottles of eye flushing fluid can be used instead.
sv: På arbetsplatser där det är svårt att ha en anordning som möjliggör till - räcklig spoltid placerad i omedelbar närhet kan man komplettera med ögonspolfl askor.

source: Choice of eye flushing device
sv: Val av anordning för ögonspolning

source: Irrespective of which device you choose, it is important that it fulfils certain functional requirements, such as
sv: Vilken typ av anordning för ögonspolning man än väljer är det viktigt att den uppfyll er vissa funktionskrav, som att den

source: being easy to activate,
sv: är lätt att utlösa,

source: preferably leaving your hands free to keep eyelids wide open, providing effective flushing for an adequate length of time d) in extended flushing, providing tempered fluid.
sv: helst ger fria händer till att hålla isär ögonlo cken,

source: It is important that the flushing device be easy to operate even by an injured or dazed person, since flushing must begin immediately.
sv: Det är viktigt att spolanordning en lätt kan utlösas även av en skadad eller omtöcknad person eftersom spolning en måste påbörj as omedelbart.

source: It is a good idea if the device is designed in such a way that flushing continues automatically once activated.
sv: Det är bra om anordning en är utfor mad så att spolning en fort sätter automatiskt efter utlösningen.

source: That way the user’s hands are free to keep the eyelids wide open.
sv: På så sätt är händerna fria för att hålla isär ögonlo cken.

source: In order for the flushing fluid to reach the injured eye, both hands normally have to be available to keep the eyelids wide open since the pain typically causes cramps in the muscles surrounding the eye.
sv: Om spolvätskan skall nå ett skadat öga, måste i allmänhet båda händerna kunna användas till att hålla isär ögonlo cken, eftersom smärtan som regel utlöser kramp i muskulaturen runt ögat.

source: Sometimes help is needed from a co-worker.
sv: Ibland kan hjälp behövas av en arbetskamrat.

source: In the case of solitary workers it may therefore be necessary for an automatic alarm to be triggered once flushing begins.
sv: När det är fråga om ensamarbete kan därför auto matiskt larm behöva utlösas när spolning en sätts igång.

source: The eyelids may become slippery (soapy) from alkali and therefore difficult to hold open with the fingers.
sv: Ögonlo cken kan bli hala (tvåliga) av alkali och därför svåra att hålla isär.

source: A piece of tissue or cloth makes this easier.
sv: Det går lättare med en bit papper eller tyg.

source: A fixed connection to the drinking water supply is often the best choice, above all because it allows for long flushing times with a continuous flow.
sv: En fast anordning ansluten till dricksvattennätet är ofta det bästa valet, framförallt för att den möjliggör en lång spoltid med kontinu erligt flöde.

source: Another advantage is that both eyes can be flushed at the same time.
sv: En annan fördel är att man kan spola båda ögonen samtidigt .

source: Flushing should always be done with a soft jet of water so that the eye is not harmed.
sv: Spolning en bör ske med mjuk vattenstråle så att inte ögat skadas.

source: Pressure reduction may be necessary.
sv: Tryck- reducering kan behövas.

source: The jet of water should not exceed 250mm.
sv: Vattenstrålen bör inte överskrida 250 mm.

source: In industries etc. where water pressure fluctuates considerably during the day, regulation of both pressure and flow may be needed in order to avoid too hard a jet of water.
sv: På industrier etc. där vattentrycket varierar kraftigt under dagen kan både tryck- och flödesreglage behövas för att undvi ka för hård vattenstråle.

source: Where extended flushing times are necessary in order to avoid injury, as is the case with splashing of substances corrosive to the eyes, it is important that flushing can be done with tempered water.
sv: Där långa spoltid er behövs för att hindr a skada, vilket är fallet efter stänk av ämnen som är frätande på ögonen, är det angeläget att spolning kan ske med tempererat vatten.

source: If only cold water is available, it may be difficult to endure a sufficiently long flushing time.
sv: Om enbart kallt vatten finns kan det bli svårt att uthärda en tillr äckligt lång spoltid .

source: The water temperature should be between 20 and 30ºC.
sv: Vattentemperaturen bör ligga i intervallet 20 till 30 C.

source: The circulation of warm water and using short pipes reduce the risk of bacterial growth.
sv: Cirkulerande varmvatten och korta ledning ar minskar risken för bakterietillv äxt.

source: A fixed device for eye flushing, connected to the drinking water supply and providing tempered water, or an equivalent device, should always be the first choice.
sv: En till dricksvattennätet fast ansluten anordning för ögonspolning med tempererat vatten eller likvärdig anordning bör alltid vara förstahandsvalet.

source: When dealing with substances corrosive to the eyes it is extremely important to have such a device, as prolonged flushing with tempered water is required to prevent eye injury.
sv: dan anordning , eftersom långvarig spolning i tempererat vatten krävs för att hindr a ögonskada.

source: If for various reasons a fixed eye flushing device cannot be chosen, eye flushing bottles and other portable devices have to be used in place of a fixed flushing device.
sv: Om fast anordning för ögonspolning av olika skäl inte kan väljas får ögonspolfl askor eller andra portabla anordning ar ersätta en fast installerad spolanordning .

source: The Work Environment Authority’s provisions on laboratory work with chemicals lay down a requirement for a permanently connected device for eye flushing with tempered water.
sv: I Arbetarskyddsstyrelsens föreskrifter om laboratoriearbete med kemikalier ställs krav på fast ansluten anordning för ögonspolning med tempererat vatten.

source: Since there is usually a risk of splashing in both eyes at the same time, and in the face as well, it is a good idea if the device has two flushing heads, or a shower head that covers both eyes as well as the face.
sv: Eftersom det oftast finns en risk för att få stänk i båda ögonen samtidigt och även i ansiktet är det bra om spolanordning en har två spol munstycken alternativt en duschstråle som täcker båda ögonen samt ansiktet.

source: As a complement to fixed flushing devices, portable devices kept in the immediate vicinity of each workstation with a splashing risk may be used.
sv: Som komplement till fast installerade spolanordning ar kan portabla anordning ar, som placeras i omedelbar närhet av varje arbetsplats med stänkrisk, användas.

source: Such devices should be of the disposable type, possibly rechargeable, and with a sterile salt solution as a flushing fluid.
sv: Dessa anordning ar bör vara av engångstyp, ev. åter- laddbara, med steril koksaltlösning som spolvätska.

source: They should provide a constant flow of flushing fluid for between 5 and 15 minutes.
sv: De bör ge ett konstant flöde av spolvätska under 5 till 15 minuter.

source: Disposable bottles with sterile contents can also be used during transportation to hospital.
sv: Engångsspolfl askor med sterilt innehåll kan även användas vid transport till sjukhus.

source: Flushing devices for repeated use and with a reservoir of standing fluid are normally unsuitable, due in particular to the danger of bacterial and algal growth.
sv: Spolanordning för flergångsbruk med stillastående vätska är i allmänhet olämplig, framför allt med tanke på tillv äxt av bakterier och alger.

source: Irrespective of which flushing device is chosen, it is important always to ensure that the flushing fluid is of a quality such that it cannot in itself cause or worsen injury.
sv: Vilken typ av spolanordning som än väljs så är det viktigt att alltid se till att spol- vätskan är av sådan kvalitet att den inte i sig kan orsaka eller förvärra skada.

source: It is important to choose a flushing device made of materials that can withstand the environment in which it is to be used.
sv: Det är viktigt att spolanordning en väljs så att materialet tål miljön .

source: This is particularly the case with corrosive environments.
sv: Det gäller framför allt i korrosiv miljö.

source: Outdoor workstations may require flushing devices that are frost resistant.
sv: På utearbetsplatser kan frosttåliga anordning ar för ögonspolning behövas.

source: The flushing device should be suitably indicated by a sign in accordance with the Work Environment Authority’s provisions on warning signs and notices in the workplace.
sv: Spolanordning en bör på lämpligt sätt markeras med skylt enligt Arbetar- skyddsstyrelsens föreskrifter om varselmärkning och varselsignalering på arbetsplatser.

source: If bottles for eye flushing are used, these should be kept in a specific place in the workstation, preferably hung on the wall.
sv: Om man använder ögonspolfl askor bör dessa finn as på bestämd plats på arbetsstället, helst upphängda på väggen.

source: It is important that flushing devices be inspected regularly so that they work when they are needed.
sv: Det är viktigt att spolanordning ar kontroll eras regelbund et så att de fungerar när de behövs.

source: It is recommended that a fixed device for eye flushing be flushed through at the beginning of every working day.
sv: Fast installerad anordning för ögonspolning spolas förslagsvis igenom i början av varje arbetsdag.

source: It is a good idea if there are workplace routines for who is to inspect the devices and when.
sv: Det är bra om man på arbetsplatsen har rutin er för vem som skall kontrol - lera anordning arna och när.

source: Written documentation of inspections should be kept available to employees and the Work Environment Inspectorate.
sv: Skriftlig dokumentation över funktionskontroll en bör förvaras tillg änglig a för arbetstagarna och Yrkesinspektionen.

source: The simplest way of doing this is to have a document posted next to the device on which the inspector writes the date and his or her name after each inspection.
sv: Enklast görs detta genom att signera med datum och namn på ett vid anordning en uppsatt dokument.

source: Eye flushing bottles normally have a limited shelf life.
sv: Ögonspolfl askor har som regel en begränsad hållbarhetstid.

source: It should be ensured that the bottles are changed before they reach the end of their shelf life.
sv: Innan denna tid har gått ut bör man se till att flaskorna byts ut.

source: It follows that routines need to be in place and someone needs to be responsible for this kind of inspection and change.
sv: Det är därför viktigt med rutin er för detta och att någon tilld elas ansvar för att bytet sker.

source: Guidance on Section 10 Emergency showers
sv: Till 10 § Nödduschar

source: Certain substances can penetrate the skin and cause poisoning.
sv: Vissa ämnen kan tränga igenom huden och ge upphov till förgiftning ar.

source: Their damaging effects can continue even after exposure has ended, because chemical reactions continue between chemicals and biological matter in human tissue.
sv: Skadeverkan kan fortsätta även då exponeringen upphört på grund av att kemiska reaktioner fortg år mellan kemikalie och biologi skt material i kroppsvävnaden.

source: Otherwise harmless substances such as metals, water and fat can cause burns from splashing in the heated state.
sv: Nor malt ofarliga ämnen som metaller, vatten och fett ger i upphettat till stånd brännskador vid stänk.

source: Examples of substances that cause skin injuries in the event of splashing or dousing are given in Appendix 3.
sv: Exempel på ämnen som ger hudskador vid stänk och översköljning ges i bilaga 3.

source: When treating a person who has been splashed or doused by a corrosive substance, it is important that those administering first aid are themselves protected against exposure.
sv: Vid omhändertagande av person som fått frätande ämne över sig är det viktigt att de som ger första hjälpen är skyddade mot exponering.

source: The emergency shower should located in a place that makes it easily accessible, e.g. by an emergency exit route.
sv: Nöddu schen bör vara placerad så att den är lätt tillg änglig , t.ex. vid utrymningsväg.

source: It may sometimes be necessary to consider fire and gas risks when choosing the location.
sv: Ibland kan man behöva ta hänsyn till brand- och gasrisker vid placeringen.

source: It may be necessary to have several emergency showers in a workstation, depending on the number of affected people and the size of the premises.
sv: Det kan behövas flera nöddu schar i lokalen beroende på antalet berörda personer och lokalens storlek.

source: In order for a person to be able to activate an emergency shower from a crawling position and possibly without the ability to grip anything, the shower could e.g. be operated by means of chains, one of which would reach all the way down to the floor.
sv: För att kunna utlösa en nöddu sch i krypande ställning och kanske utan gripför måga kan duschen t.ex. utlösas med kedjor varav en går ända ned till golvet.

source: By attaching this chain to the wall, the shower could be operated without a gripping movement.
sv: Genom att fästa denna kedja vid väggen kan spolning utlösas utan griprör else.

source: Alternatively the shower could be operated by means of pressure plates placed at the appropriate height on the wall or the floor.
sv: Alternativt kan duschen utlösas med tryckplattor som placeras på lagom höjd på väggen eller på golvet.

source: The purpose of an emergency shower is quickly to extinguish burning clothes or remove a dangerous substance from the body.
sv: Nöddu schens syfte är att snabbt släcka brand i kläder eller att snabbt avlägsna farligt ämne från kroppen.

source: The shower head and water volume should be large enough for the entire body to be covered in a large amount of water within a few seconds.
sv: Duschstrilen och vattenmängden bör vara så stor att hela kroppen täcks av en stor mängd vatten ino m några sekunder.

source: Alternatively the shower can consist of a stand with several shower heads that cover the entire body in water.
sv: Alternativt kan duschen bestå av en ställning med ett flertal strilar som täcker hela kroppen med vatten.

source: Many companies sell showers that can be assembled to the client’s specifications.
sv: Många företag marknadsför duschar som kan utför as efter kundens önskemål.

source: Extended showering times are often required in order to prevent further injury and to alleviate pain.
sv: Ofta krävs en lång spoltid för att hindr a vidare skada och för att lindr a smärta.
